start_msg = '''
Добро пожаловать в банкомат!
1 Пополнить баланс
2 Снять наличные
3 История операций
4 Завершить работу
'''

input_ch_msg = 'Выберите номер действия: '
finish_msg = '\nБлагодарим за использование наших услуг'
mistake_msg = '\nОшибка ввода! Повторите ввод.\n'
cashe_error = '\nВведена недопустимая сумма!\n'
input_msg = '\nВведите сумму для внесения: '
insert_msg = '\nВведите сумму для снятия: '
out_balance = 'На счету осталось средств: '
ins_msg = 'Со счет снята сумма:'
inp_msg = 'На счет внесена сумма: '